runs/stateful/full_paper/exp1_ttft_reduction_llama3_sglang/sglang_runs/meta-llama_Meta-Llama-3-8B-Instruct/ctx6144_out64_a16_b8_s0/sglang_bench_raw.txt
benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=50198, ready_check_timeout_sec=60, dataset_name='random', dataset_path='', model='meta-llama/Meta-Llama-3-8B-Instruct', served_model_name=None, tokenizer='meta-llama/Meta-Llama-3-8B-Instruct', num_prompts=32, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=6144, random_output_len=64, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=None, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None)
Waiting up to 60s for http://127.0.0.1:50198/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=50198, ready_check_timeout_sec=60, dataset_name='random', dataset_path='', model='meta-llama/Meta-Llama-3-8B-Instruct', served_model_name=None, tokenizer='meta-llama/Meta-Llama-3-8B-Instruct', num_prompts=32, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=6144, random_output_len=64, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=None, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None)

#Input tokens: 93926
#Output tokens: 947
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 not set   
Successful requests:                     32        
Benchmark duration (s):                  4.27      
Total input tokens:                      93926     
Total input text tokens:                 93926     
Total generated tokens:                  947       
Total generated tokens (retokenized):    949       
Request throughput (req/s):              7.50      
Input token throughput (tok/s):          22022.44  
Output token throughput (tok/s):         222.04    
Peak output token throughput (tok/s):    657.00    
Peak concurrent requests:                32        
Total token throughput (tok/s):          22244.48  
Concurrency:                             28.97     
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   3861.36   
Median E2E Latency (ms):                 3924.37   
P90 E2E Latency (ms):                    4220.66   
P99 E2E Latency (ms):                    4250.14   
---------------Time to First Token----------------
Mean TTFT (ms):                          2086.16   
Median TTFT (ms):                        2301.71   
P99 TTFT (ms):                           3575.32   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          200.13    
Median TPOT (ms):                        60.30     
P99 TPOT (ms):                           2236.78   
---------------Inter-Token Latency----------------
Mean ITL (ms):                           62.08     
Median ITL (ms):                         9.88      
P95 ITL (ms):                            12.21     
P99 ITL (ms):                            2300.88   
Max ITL (ms):                            3367.82   
==================================================


  0%|          | 0/32 [00:00<?, ?it/s]
  3%|▎         | 1/32 [00:00<00:20,  1.52it/s]
  6%|▋         | 2/32 [00:03<01:01,  2.05s/it]
 31%|███▏      | 10/32 [00:03<00:06,  3.58it/s]
 50%|█████     | 16/32 [00:03<00:02,  6.49it/s]
 62%|██████▎   | 20/32 [00:04<00:01,  8.42it/s]
 88%|████████▊ | 28/32 [00:04<00:00, 14.27it/s]
100%|██████████| 32/32 [00:04<00:00,  7.52it/s]